//Отпечатайте фигурата триъгълник с n реда с помощта на символа @. Използвай цикли, а не просто принтиране.
// function printTriangle(n) {
//   for (let i = 0; i < n; i++) {
//     let row = '';
//     for (let j = 0; j <= i; j++) {
//       row += '@';
//     }
//     console.log(row);
//   }
// }

//2. Напишете програма, която отпечатва числата, кратни на 5 от 10 до 50.

// Направете така, че програмата да прекъсне, ако числото е по-голямо от 39.

// for (let i = 10; i <= 50; i += 5) {
//   if (i > 39) {
//     break;
//   }
//   console.log(i);
// }

// 3. Даден е масив от 20 произволни цели числа. Масивът може да е инициализиран в програмата или да се входира от клавиатурата. 

// Да се напише програма, която да изведе броя на нечетните числа в масива.

// let numbers = [2, 5, 6, 9, 11, 15, 18, 21, 24, 26, 30, 33, 35, 37, 40, 42, 45, 48, 51, 54];
// let oddCount = 0;

// for (let i = 0; i < numbers.length; i++) {
//   if (numbers[i] % 2 !== 0) {
//     oddCount++;
//   }
// }

// console.log(`Брой на нечетните числа: ${oddCount}`);


// Да се напише програма, която задава масив от реални числа, инициализиран в програмата или входиран от клавиатурата.

// Програмата определя кои числа са цели числа и принтира на екрана всички цели числа от този масив.

let nums = [2.5, 3, 7.8, 10, 11.2, 15, 20.1];

// обхождане на масива и извеждане на целите числа
for (let i = 0; i < nums.length; i++) {
  if (Number.isInteger(nums[i])) {
    console.log(nums[i]);
  }
}