function solve(input) {

    let firstNumberUpToNum = Number(input[0]);
    let secondNumberUpToNum = Number(input[1]);
    let thirdNumberUpToNum = Number(input[2]);


    for (let i = 2; i <= firstNumberUpToNum; i++) {
        if (i % 2 === 0) {
            for (let j = 2; j <= secondNumberUpToNum; j++) {        // най-малкото просто число е 2; в начална стойност е ок
                if (j === 2 || j === 3 || j === 5) {        // много каруцарски метод за намиране на просто число, но отговаря на диапазона в условието
                    for (let k = 2; k <= thirdNumberUpToNum; k++) {
                        if (k % 2 === 0) {
                            console.log(`${i} ${j} ${k}`);
                        }

                    }

                }
            }
        }
    }
}
solve(["8",
    "2",
    "8"])


// Да се напише програма, която генерира трицифрени PIN кодове, като цифрите на всеки PIN код са в определен интервал.За да бъде валиден един PIN код той трябва да отговаря на следните условия:
// •	Първата и третата цифра трябва да бъдат четни
// •	Втората цифра трябва да бъде просто число в диапазона[2...7]
// Вход:
// От конзолата се четат 3 реда:
// •	Горната граница на първото число - цяло число в диапазона[1...9]
// •	Горната граница на второто число - цяло число в диапазона[1...9]
// •	Горната граница на третото число - цяло число в диапазона[1...9]

// for (let i = 2; i <= Math.sqrt(num); i++) {
//     if (num % i === 0) {
//         isPrime = false;
//     }
// }